setup -  case3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.4;
maxAlphaCo      0.4;

maxDeltaT       0.01;

functions
(
/*
  probe1
   {
     type probes;
     functionObjectLibs ("libsampling.so");
     enabled true;
     outputControl timeStep;
     outputInterval 20;
     outputFormat raw;
     probeLocations
   (


     );
     
     fields
      (
        alpha1
        U
        p
      );
    }
   
  probe2
   {
     type probes;
     functionObjectLibs ("libsampling.so");
     enabled true;
     outputControl timeStep;
     outputInterval 20;
     outputFormat raw;
     probeLocations
   (
     );
     
     fields
      (
        alpha1
        U
        p
      );
    }

  probe3
   {
     type probes;
     functionObjectLibs ("libsampling.so");
     enabled true;
     outputControl timeStep;
     outputInterval 10;
     outputFormat raw;
     probeLocations
   (
     );
     
     fields
      (
        alpha1
        U
        p
      );
    }

  probe4
   {
     type probes;
     functionObjectLibs ("libsampling.so");
     enabled true;
     outputControl timeStep;
     outputInterval 10;
     outputFormat raw;
     probeLocations
   (
     );
     
     fields
      (
        alpha1
        U
        p
      );
    }

  probe5
   {
     type probes;
     functionObjectLibs ("libsampling.so");
     enabled true;
     outputControl timeStep;
     outputInterval 10;
     outputFormat raw;
     probeLocations
   (

     );
     
     fields
      (
        alpha1
        U
        p
      );
    }
*/
);

libs ( 
"libOpenFOAM.so" 
//"libgroovyBC.so"
//"libsimpleSwakFunctionObjects.so"
//"libswakFunctionObjects.so"
"libsampling.so"
/*
"libdynamicSmagorinskyModel.so"
*/
//"libnuSgsWallFunction.so"
"libnuSgsKungfuWallFunction.so"
"libnuSgsSmoothYar.so"
) ;

// ************************************************************************* //
