setup -  case3/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}
////////////////////////////////////////////////////////////////////////////////
    castellatedMesh true;
    snap true;       // snap back to surface?>
    addLayers false; // add viscous layer?
///////////////////////////////////////////////////////////////////////
    geometry
    {
        breakwater.stl
        {
            type triSurfaceMesh;
            name breakwater;
            appendRegionName true;
        }

    }
///////////////////////////////////////////////////////////
    castellatedMeshControls
    {
        features
        (
	{
	file "breakwater.eMesh";
	level 2;
	}        
	);
        refinementSurfaces
        {
            breakwater
            {
                level ( 1 2 );
            }
        }
        refinementRegions
        {
        }
        locationInMesh ( 0 0 0);
        maxLocalCells 1000000; // max cells per CPU core --> 1 million
        maxGlobalCells 20000000;
        minRefinementCells 0;
        nCellsBetweenLevels 2;
        resolveFeatureAngle 30;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 30;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
    }
    addLayersControls
    {
        layers
        {
            breakwater
            {
                nSurfaceLayers 2;
                expansionRatio 1.25;
                finalLayerThickness 0.4;
            }
        }

        relativeSizes true;
        expansionRatio 1.0;
        finalLayerThickness 0.3;
        minThickness 0.25;
        nGrow 0;
        featureAngle 130;
        slipFeatureAngle 30;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 65;
        maxBoundarySkewness 20;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.00E-13;
        minTetQuality 1e-15;
        minArea -1;
        minTwist 0.02;
        minDeterminant 0.001;
        minFaceWeight 0.05;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
        relaxed
        {
            maxNonOrtho 75;
        }

    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
