setup -  case3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type             uniformFixedValue;
	uniformValue	tableFile;
	tableFileCoeffs	
	{
	fileName	"pistonVec.dat";
        outOfBounds      clamp;
        value           uniform (0 0 0);
	}
    }
    backWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    sideWallS
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	sideWallNS
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	
    breakwater
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    lowerWallS
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	lowerWallNS
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphereS
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	atmosphereNS
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
