setup -  case3/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    backWall
    {
        type            zeroGradient;
    }
    
    sideWallS
    {
        type            zeroGradient;
    }
	sideWallNS
    {
        type            zeroGradient;
    }
    breakwater
    {
        type            zeroGradient;
    }    

    lowerWallS
    {
        type            zeroGradient;
    }
	lowerWallNS
    {
        type            zeroGradient;
    }
    atmosphereS
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
	atmosphereNS
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
