setup -  case3/0/flm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      flm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 4 -4 0 0 0 0];

internalField   uniform 1e-10;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-10;
    }

    backWall
    {
        type            fixedValue;
        value           uniform 1e-10;
    }

    sideWallS
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    sideWallNS
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    breakwater
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    lowerWallS
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
	lowerWallNS
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    atmosphereS
    {
        type            zeroGradient;
    }
	atmosphereNS
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
