setup -  case3/0/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-11;

boundaryField
{
    inlet
    {
        type            nuSgsKungfuWallFunction;
        value           uniform 0;
    }

    backWall
    {
        type            nuSgsKungfuWallFunction;
        value           uniform 0;
    }

    sideWallS
    {
        type            nuSgsKungfuWallFunction;//nuSgsSmoothYar;
        value           uniform 0;
    }
    sideWallNS
    {
        type            nuSgsKungfuWallFunction;//nuSgsSmoothYar;
        value           uniform 0;
    }
    breakwater
    {
//        type		zeroGradient;
        type            nuSgsKungfuWallFunction;//nuSgsSmoothYar;
        value           uniform 0;
    }

    lowerWallS
    {
        type            nuSgsKungfuWallFunction;//nuSgsSmoothYar;
        value           uniform 0;
    }
	lowerWallNS
    {
        type            nuSgsKungfuWallFunction;//nuSgsSmoothYar;
        value           uniform 0;
    }
    atmosphereS
    {
	type		inletOutlet;
	inletValue	uniform 1e-11;
	value		uniform 1e-11;
        //type            zeroGradient;
    }
	atmosphereNS
    {
	type            inletOutlet;
        inletValue      uniform 1e-11;
        value           uniform 1e-11;
//       type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
