setup -  case3/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-1 0 -13.25) (44 0.55 13.25);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
//    boxToCell
//    {
//        box (1 0 0) (5.4 0.06 0.45);
//        fieldValues
//        (
//            volScalarFieldValue alpha1 1
//       );
//    }
);




// ************************************************************************* //
